; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v4 ?v9)
             (pred_12 ?v7 ?v1)
             (pred_11 ?v4 ?v1)
             (pred_6 ?v11 ?v4 )
	     (pred_8 ?v4)
             (pred_5 ?v12)
             (pred_2 ?v7)
             (pred_9 ?v1)
             (pred_7 ?v4)
             (pred_10 ?v7)
             (pred_1 ?v4)
             (pred_3 ))



(:action op_2
:parameters (?v5 ?v8 ?v2 ?v3)
:precondition (and (pred_5 ?v5) (pred_5 ?v8) (pred_2 ?v2) (pred_9 ?v3)
          (pred_4 ?v5 ?v8) (pred_12 ?v2 ?v3)
                   (pred_11 ?v8 ?v3) (pred_8 ?v5) 
                   (pred_7 ?v8) (pred_10 ?v2))
:effect (and  (pred_1 ?v8) (not (pred_7 ?v8))))


(:action op_4
:parameters (?v5 ?v10)
:precondition (and (pred_5 ?v5) (pred_5 ?v10)
               (pred_8 ?v5) (pred_4 ?v5 ?v10) (pred_1 ?v10))
:effect (and (pred_8 ?v10) (not (pred_8 ?v5))))

(:action op_5
:parameters (?v5 ?v2)
:precondition (and (pred_5 ?v5) (pred_2 ?v2) 
                  (pred_8 ?v5) (pred_6 ?v2 ?v5) (pred_3 ))
:effect (and (pred_10 ?v2)
   (not (pred_6 ?v2 ?v5)) (not (pred_3 ))))


(:action op_3
:parameters (?v5 ?v6 ?v13)
:precondition (and (pred_5 ?v5) (pred_2 ?v6) (pred_2 ?v13)
                  (pred_8 ?v5) (pred_10 ?v13) (pred_6 ?v6 ?v5))
:effect (and (pred_10 ?v6) (pred_6 ?v13 ?v5)
        (not (pred_10 ?v13)) (not (pred_6 ?v6 ?v5))))

(:action op_1
:parameters (?v5 ?v2)
:precondition (and (pred_5 ?v5) (pred_2 ?v2) 
                  (pred_8 ?v5) (pred_10 ?v2))
:effect (and (pred_3 ) (pred_6 ?v2 ?v5) (not (pred_10 ?v2)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_11 obj_10 obj_08 obj_12 obj_19 obj_14 obj_01 obj_02 obj_16 obj_04 obj_07 obj_18 obj_20 obj_15 obj_06 obj_03
    obj_17 obj_05
    obj_09 obj_13
    )

    (:init
       (pred_3)

       (pred_5 obj_11)
       (pred_5 obj_10)
       (pred_5 obj_08)
       (pred_5 obj_12)
       (pred_5 obj_19)
       (pred_5 obj_14)
       (pred_5 obj_01)
       (pred_5 obj_02)
       (pred_5 obj_16)
       (pred_5 obj_04)
       (pred_5 obj_07)
       (pred_5 obj_18)
       (pred_5 obj_20)
       (pred_5 obj_15)
       (pred_5 obj_06)
       (pred_5 obj_03)
       (pred_9 obj_17)
       (pred_9 obj_05)
       (pred_2 obj_09)
       (pred_2 obj_13)

       (pred_4 obj_11 obj_19)
       (pred_4 obj_11 obj_10)
       (pred_4 obj_10 obj_14)
       (pred_4 obj_10 obj_08)
       (pred_4 obj_10 obj_11)
       (pred_4 obj_08 obj_01)
       (pred_4 obj_08 obj_12)
       (pred_4 obj_08 obj_10)
       (pred_4 obj_12 obj_02)
       (pred_4 obj_12 obj_08)
       (pred_4 obj_19 obj_16)
       (pred_4 obj_19 obj_14)
       (pred_4 obj_19 obj_11)
       (pred_4 obj_14 obj_04)
       (pred_4 obj_14 obj_01)
       (pred_4 obj_14 obj_10)
       (pred_4 obj_14 obj_19)
       (pred_4 obj_01 obj_07)
       (pred_4 obj_01 obj_02)
       (pred_4 obj_01 obj_08)
       (pred_4 obj_01 obj_14)
       (pred_4 obj_02 obj_18)
       (pred_4 obj_02 obj_12)
       (pred_4 obj_02 obj_01)
       (pred_4 obj_16 obj_20)
       (pred_4 obj_16 obj_04)
       (pred_4 obj_16 obj_19)
       (pred_4 obj_04 obj_15)
       (pred_4 obj_04 obj_07)
       (pred_4 obj_04 obj_14)
       (pred_4 obj_04 obj_16)
       (pred_4 obj_07 obj_06)
       (pred_4 obj_07 obj_18)
       (pred_4 obj_07 obj_01)
       (pred_4 obj_07 obj_04)
       (pred_4 obj_18 obj_03)
       (pred_4 obj_18 obj_02)
       (pred_4 obj_18 obj_07)
       (pred_4 obj_20 obj_15)
       (pred_4 obj_20 obj_16)
       (pred_4 obj_15 obj_06)
       (pred_4 obj_15 obj_04)
       (pred_4 obj_15 obj_20)
       (pred_4 obj_06 obj_03)
       (pred_4 obj_06 obj_07)
       (pred_4 obj_06 obj_15)
       (pred_4 obj_03 obj_18)
       (pred_4 obj_03 obj_06)
       (pred_7 obj_08)
       (pred_7 obj_03)
       (pred_11  obj_08 obj_17)
       (pred_11  obj_03 obj_05)
       (pred_1 obj_11)
       (pred_1 obj_10)
       (pred_1 obj_12)
       (pred_1 obj_19)
       (pred_1 obj_14)
       (pred_1 obj_01)
       (pred_1 obj_02)
       (pred_1 obj_16)
       (pred_1 obj_04)
       (pred_1 obj_07)
       (pred_1 obj_18)
       (pred_1 obj_20)
       (pred_1 obj_15)
       (pred_1 obj_06)

       (pred_12  obj_09 obj_17)
       (pred_12  obj_13 obj_05)
       (pred_6 obj_09 obj_07)
       (pred_6 obj_13 obj_01)
       (pred_8 obj_11)
    )

    (:goal (and
       (pred_6 obj_13 obj_19)
    ))
(:constraints
  (always (not (pred_8 obj_14)))
)
)

; plan
1. (op_4 obj_11 obj_19)
   deleted: (pred_8 obj_11)
   added: (pred_8 obj_19)
   goals met: 0 of 1
2. (op_4 obj_19 obj_16)
   deleted: (pred_8 obj_19)
   added: (pred_8 obj_16)
   goals met: 0 of 1
3. (op_4 obj_16 obj_04)
   deleted: (pred_8 obj_16)
   added: (pred_8 obj_04)
   goals met: 0 of 1
4. (op_4 obj_04 obj_07)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_07)
   goals met: 0 of 1
5. (op_4 obj_07 obj_01)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_01)
   goals met: 0 of 1
6. (op_5 obj_01 obj_13)
   deleted: (pred_6 obj_13 obj_01) (pred_3)
   added: (pred_10 obj_13)
   goals met: 0 of 1
7. (op_4 obj_01 obj_07)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_07)
   goals met: 0 of 1
8. (op_4 obj_07 obj_04)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_04)
   goals met: 0 of 1
9. (op_4 obj_04 obj_16)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_16)
   goals met: 0 of 1
10. (op_4 obj_16 obj_19)
   deleted: (pred_8 obj_16)
   added: (pred_8 obj_19)
   goals met: 0 of 1
11. (op_1 obj_19 obj_13)
   deleted: (pred_10 obj_13)
   added: (pred_3) (pred_6 obj_13 obj_19)
   goals met: 1 of 1
